{"versions":["0.4.5","0.4.3","0.4.2","0.4","0.3.2.1","0.3.2","0.3.1","0.3","0.2","0.1","0.0"],"0.3.1":{"short":"Adicionado o changelog","long":"Foi adicionado nessa versão o changelog, junto com os comandos de adicionar novas versões ao changelog."},"0.3":{"short":"Sistema de warn, implementação de novos comandos e correção de bugs","long":"Foi adicionado o sistema de avisos, em que o bot armazena o log do aviso criado por um admin no banco de dados para visualização futura. Também foi adicionado um 8ball, e algumas correções de bugs foram feitas."},"0.2":{"short":"Sistema de ban, kick e mute","long":"Sistemas de administração foram adicionados nessa versão, um sistema de mute, kick e ban sofisticados."},"0.1":{"short":"Nascimento do bot c:","long":"Só isso mesmo"},"0.0":{"short":"Você veio longe, hein?","long":"O bot nem existia aqui :v"},"0.3.2":{"short":"correções de bugs no changelog","long":"foram corrigidos alguns bugs pequenos no changelog."},"0.3.2.1":{"short":"resolvido bug do warn","long":"havia um bug no sistema de warn, onde o bot não conseguia localizar o id do usuário, o mesmo ja foi corrigido"},"0.4":{"short":"2 novos comandos para os membros e mais um comando para a administração, além de pequenas correções de bugs","long":"- agora o changelog aparecerá nos <#380375162106937346> assim que for publicado uma nova versão.\n- comando random adicionado, onde ele irá gerar um número aleatório seguindo os critérios definidos\n- comando stats adicionado, onde o bot irá gerar uma tabela com alguns dados sobre ele\n- comando clear adicionado para a administração, ele irá apagar x mensagens do canal onde o comando foi digitado\n- correções de bugs no sistema de ban e warn, assim como uma pequena correção no 8ball"},"0.4.2":{"short":"Adicionado o perfil do YouTube e o comando Eval","long":"Foram adicionados 2 comandos do perfil do youtube, o setprofile e o profile, onde pode ser setado o seu perfil do YouTube e visualizar o dos outros membros, respectivamente. Os perfis serão automaticamente atualizados todo dia à meia noite. Também foi adicionado um comando Eval."},"0.4.3":{"short":"Correções de bugs","long":"Uma pequena correção de bug no comando info e no changelog","timestamp":"2018-02-17T01:12:59.966Z"},"0.4.5":{"short":"Removido o comando stats, adicionado a busca no Google e YouTube, e um sistema de help mais simples","long":"- Foi removido o comando stats, que estava gerando problemas de corrompimento de arquivos do banco de dados do bot.\n- Foram adicionados as pesquisas do Google e do YouTube\n- O sistema de help foi refeito para ocupar menos espaço","timestamp":"2018-02-18T07:30:29.060Z"}}